using Microsoft.EntityFrameworkCore;

namespace FilmsApp.Models
{
    public class FilmContext : DbContext
    {
        public DbSet<Film> Films { get; set; }

        public FilmContext(DbContextOptions<FilmContext> options)
            : base(options)
        {
            if (Database.EnsureCreated())
            {
                Films?.Add(new Film
                {
                    Name = "Мовчання ягнят",
                    Year =  1991,
                    Genre = "Драми, Кримінал, Трилери",
                    Director = "Джонатан Демме",
                    Actors = "Джоді Фостер, Лоуренс А. Бонні, Кейсі Леммонс, Лоуренс Т. Ренц, Скот Ґленн, Ентоні Гілд, Ентоні Гопкінс",
                    Description = "Кримінальний детектив «Мовчання ягнят» знятий за однойменним романом американського " +
                    "письменника Томаса Харріса.\r\nНа Середньому Заході США бешкетує серійний маніяк. Він викрадає жінок," +
                    " а після того як вбиває, здирає з них шкіру, за що його прозвали «Буффало Білл». ФБР робить все можливе, " +
                    "щоб зупинити злочинця, проте, їм не вдається знайти ні однієї зачіпки, яка допомогла б вийти на його слід. " +
                    "У світлі ситуації, що склалася, вони вирішують звернутися за допомогою до небезпечного вбивці Ганнібала " +
                    "Лектора, який нині відбуває ув'язнення в одній з психіатричних лікарень. До цієї справи залучають молоду " +
                    "стажерку Кларису Старлінг. Лектор погоджується допомогти, але тільки за однієї умови: дівчина повинна " +
                    "посвятити його в подробиці свого життя. Через брак вибору, Кларисі не залишається нічого іншого, як піти " +
                    "назустріч. Але чи буде виправданий такий ризик?",
                    Image = "/img/1.jpg"
                });
                Films?.Add(new Film
                {
                    Name = "Зелена миля",
                    Year =  1999,
                    Genre = "Детективи, Драми, Кримінал, Фентезі",
                    Director = "Френк Дарабонт",
                    Actors = "Том Генкс, Девід Морс, Майкл Кларк Дункан, Бонні Хант, Джеймс Кромвелл, Майкл Джитер",
                    Description = "Культова драма «Зелена миля» знята за однойменним романом Стівена Кінга. Головну роль в картині виконав неповторний Том Хенкс. Дії фільму розгортаються в тюрмі «Холодна Гора». Одного разу в блок для засуджених до смертної кари поступає новий в'язень - Джон Коффі, засуджений за вбивство маленьких дівчаток. Коффі привертає увагу начальника цього блоку - Пола Еджкомба. За довгі роки роботи він надивився на різних злочинців, і він трохи розбирається в людях. Пол сумнівається у винності Коффі, адже не дивлячись на його страхітливий вигляд, він наділений наївною добротою і людяністю. Так само з часом з'ясовується, що Джон є володарем дивного дару - здатності зцілювати. Пол розуміє, що така людина ніяк не може бути вбивцею. Але що ж робити, і як допомогти йому? На противагу добру завжди виступає злою. Цього разу воно виступить в образі Персі - молодого тюремника, який обожнює робити життя в'язнів нестерпним.",
                    Image = "/img/2.jpg"
                });
                Films?.Add(new Film
                {
                    Name = "Недоторканні / 1+1",
                    Year =  2011,
                    Genre = "Комедія, Драми, Біографія",
                    Director = "Олів'є Накаш",
                    Actors = "Ерік Толедано, Франсуа Клюзе, Омар Сі, Анн Ле Ні, Одрі Флеро, Жозефін де Мо",
                    Description = "Філіпу не потрібні гроші - у нього їх більш ніж достатньо. Правда, є проблема: літаючи на пароплані, він потрапив в аварію і з тих пір прикутий до інвалідного крісла. Йому потрібна доглядальниця. З служби зайнятості надсилають темношкірого Дрісса - людину з сумнівним минулим і невизначеним майбутнім. Хлопець просить письмову відмову, щоб, не працюючи, отримувати допомогу, але Філіп непохитний у вирішенні найняти саме його. Іноді ти повинен побувати в чужому світі, щоб зрозуміти, чого тобі бракує у власному. Під таким слоганом в вересні 2011 року вийшов у світовий прокат фільм 1 + 1. Сюжет повністю відповідає. Філіп - чистісінької води аристократ з відповідними манерами. Дрісс - мігрант, який не знає хороших манер, якому не чужі проблеми з законом, а жінки його цікавлять в суто постільному плані. Безгрошовий африканець дивиться на проблеми крізь пальці, чим так чарує Філіпа, який розуміє, що у хлопця можна і потрібно повчитися. У свою чергу, і Дрісс використовує шанс розкрити свої найкращі якості. У підсумку ці дві людини зіграють в житті один одного важливі ролі. Події будуть супроводжуватися веселими ситуаціями і ліричними відступами.",
                    Image = "/img/3.jpg"
                });
                Films?.Add(new Film
                {
                    Name = "Реквієм по мрії",
                    Year =  2000,
                    Genre = "Драми",
                    Director = "Даррен Аронофскі",
                    Actors = "Еллен Берстін, Джаред Лето, Дженніфер Коннеллі, Марлон Веянс, Крістофер МакДональд, Луїза Лессер",
                    Description = "Прожити життя - просто. Прожити його гідно - складніше. Домогтися серйозних успіхів - дуже важко, для цього потрібно діяти, крокувати до мети. Найпростіше пустити її на самоплив, кинути під укіс і не розмірковувати ні про що. Цим шляхом пішов Гаррі. Наркотична дрімота і прекрасні бачення, щастя, випробуване «під кайфом» замінюють його реальність. Його мати - Сара, щоб не бачити жахів або від власної слабкості, а більше - від прагнення змін, повністю занурилася в світ по той бік телевізійного екрану. Життя її улюблених героїв замінює їй власне ...\r\nАле вони не тільки руйнують себе і своє життя, вони притягують до себе своїх друзів, щоб не тонути одинокими. І вже мало часу залишилося у них до моменту, коли все навколо почне розвалюватися на частини ...",
                    Image = "/img/4.jpg"
                });
                Films?.Add(new Film
                {
                    Name = "Острів проклятих",
                    Year =  2010,
                    Genre = "Детективи, Драми, Трилери",
                    Director = "Мартін Скорсезе",
                    Actors = "Леонардо ДіКапріо, Марк Руффало, Бен Кінґслі, Макс фон Сюдов, Мішель Вільямс, Емілі Мортімер",
                    Description = "Психологічний ретро-трилер, знятий за романом письменника і кіносценариста Денніса Ліхейна.\r\n1954 рік. Два бостонських федеральних маршала - досвідчений Тедді Деніелс і нещодавно переведений з Сіетла Чак Аулі - пливуть на острів Шаттер (Острів проклятих). Там знаходиться психлікарня, яка добре охороняється а порядками нагадує в'язницю, куди поміщені божевільні злочинці. Незважаючи на охорону, замки і справну сигналізацію з режимної лікарні примудрилася втекти особливо небезпечна божевільна - Рейчел Соландо, яка в божевіллі втопила своїх дітей.\r\nНа ділі для Деніелса це відрядження - лише привід відвідати каземати для божевільних: на острові міститься піроман Ендрю Леддіс, винуватець загибелі дружини маршала. Знайти його і утікачку Рейчел - ось завдання для Деніелса, проте розслідування чиновників наштовхується на опір двох завідуючих лікарнею і всього медперсоналу. У їхніх діях змученому головним болем федеральному маршалу починає бачитися якась змова, яка заважає розпочатому розслідуванню.",
                    Image = "/img/5.jpg"
                });
                Films?.Add(new Film
                {
                    Name = "Віднесені вітром",
                    Year =  1939,
                    Genre = "Військові, Драми, Історичні, Романтичні",
                    Director = "Віктор Флемінг",
                    Actors = "Джордж Кьюкор, Сем Вуд, Томас Мітчелл, Барбара О'ніл, Вів'єн Лі, Евелін Кійес",
                    Description = "«Віднесені вітром» - відзначений вісьмома «Оскарами» фільм-легенда, екранізація знаменитого бестселера Маргарет Мітчелл. Історія про кохання, війну, вірність, втрачені ілюзії та прекрасний Південь - квітуча земля, що колись належала шляхетним джентльменам.\r\nВесна 1861 року, напередодні Громадянської війни. Зеленоока кокетка Скарлетт О'Хара, легко розбиває серця молодих кавалерів, збираючись на бал, мріє про грандіозну перемогу. У планах Скарлетт - заручення з витонченим Ешлі Вілксом, на жаль, вже зарученим з кузиною Мелані. Цей бал стане останнім мирним святом старої доброї Джорджії: дуже скоро вихор битв зруйнує колишнє життя, змете неоглядні плантації та змусить забути смішні довоєнні засмучення.\r\nВідважні солдати залишаться на полях великої битви, а бездоганні леді пожертвують всім заради Півдня і коханих. Переживши загибель близьких і дорогих людей, голод, руйнування і принизливу Реконструкцію, Скарлетт залишиться вірною своєму слову, давній мрії й головній цінності - землі свого батька.",
                    Image = "/img/6.jpg"
                });
                Films?.Add(new Film
                {
                    Name = "12 років рабства",
                    Year =  2013,
                    Genre = "Драми, Історичні, Біографія",
                    Director = "Стів Макквін",
                    Actors = "Чівател Еджіофор, Дуайт Генрі, Браян Бетт, Келсі Скотт",
                    Description = "Шокуюча та захоплююча історична драма про людську ницість, підлість, жадібність та силу людського духу. Події розгортаються у середині XIX століття. Північно-східні штати вже давно відмовилися від рабовласництва і за законами афроамериканці мають права нарівні з білими громадянами. Соломон Нортал - середньої руки трудяга з передмістя Нью-Йорка, люблячий чоловік і батько, майстер гри на скрипці, який відправляється підзаробити до Вашингтону, де стає жертвою викрадачів. Розбійники переправляють його на Південь, де Соломон стає рабом на плантаціях. Переходячи від одного рабовласника до іншого, відчуваючи тяготи і злидні, загрози і побої, Соломон не втрачає стійкості духу навіть в найважчі часи, сподіваючись, що одного разу до нього повернеться свобода… Фільм «12 років рабства» (2013) надзвичайно сильне кіно, яке буде цікаво дивитись українською усім шанувальникам драми.",
                    Image = "/img/7.jpg"
                });
                Films?.Add(new Film
                {
                    Name = "Володар перснів: Повернення короля",
                    Year =  2003,
                    Genre = "Пригоди, Драми, Фентезі",
                    Director = "Пітер Джексон",
                    Actors = "Ноел Епплбі, Олександра Естін, Шон Астін, Девід Астон, Джон Беч, Вігго Мортенсен, Елайджа Вуд, Ієн Маккеллен",
                    Description = "В черговий раз хобітам доведеться доводити всьому світу, що зло в образі Саурона, можна перемогти. Але на цей раз повелитель темряви зайшов занадто далеко і вже майже святкує перемогу. Він ще не знає, що представники людської раси настільки хитрі, що завжди знаходяться на крок вперед. Тепер великий Саурон направляє свої раті до стін Мінас-Тирита, які захищають фортецю Останньої Надії. Але саме велич його розмірів не дозволяє Саурону розгледіти дві химерні людські фігурки. Чи вдасться хобітам повалити Саурона і дістати назад Кільце Всевладдя, сила якого має магічний вплив на кожного, хто його одягав? Чи зможе головний герой знищити символ влади над людством? І найголовніше, чи залишаться у нього друзі до фінального завершення фільму?",
                    Image = "/img/8.jpg"
                });
                Films?.Add(new Film
                {
                    Name = "Володар перснів: Хранителі персня",
                    Year =  2001,
                    Genre = "Пригоди, Драми, Фентезі",
                    Director = "Пітер Джексон",
                    Actors = "Алан Говард, Ноел Епплбі, Шон Астін, Сала Бейкер, Шон Бін, Кейт Бланшетт, Елайджа Вуд, Ієн Маккеллен, Вігго Мортенсен",
                    Description = "Багато років тому темний повелитель Саурон втратив кільце, що дає величезну могутність, і тепер намагається його повернути. Хоббіт Більбо Беггінс випадково знаходить бажане кільце, завдяки чому прожив, не знаючи про його велику силу, до 111 років.\r\nЧарівник Гендальф передає річ Фродо, племіннику Більбо, який стоїчно справляється з силою, яку воно йому дає. Разом зі своїм другом Семом вони відправляються в небезпечні пригоди, щоб стерти з лиця землі кільце, яке приносить одні тільки нещастя. До них приходять на допомогу ельфи, хоббіти і енти. Безліч випробувань доведеться пройти головним героям: спокуса кільцем, голод, недовіра, позбавлення під час усієї подорожі. Перед нами відкриваються красиві пейзажі, а музика, яка супроводжує фільм, просто зачаровує.",
                    Image = "/img/9.jpg"
                });
                Films?.Add(new Film
                {
                    Name = "Володар перснів: Дві вежі",
                    Year =  2002,
                    Genre = "Пригоди, Драми, Фентезі",
                    Director = "Пітер Джексон",
                    Actors = "Брюс Олпресс, Шон Астін, Джон Беч, Сала Бейкер, Кейт Бланшетт, Орландо Блум, Вігго Мортенсен, Ієн Маккеллен, Елайджа Вуд",
                    Description = "Друга екранізація відомого роману Дж. Р.Р. Толкіна «Володар кілець». Фільм був знятий режисером Пітером Джексоном і вийшов в прокат 18 грудня 2002 року.\r\n\r\nБратство кільця розпалося. Двом маленьким гобітам Фродо і Сему було доручено знищити Кільце Всевладдя в жерлі Фатальної гори. Їх переслідує Ґолум - дивна істота, яка страждає роздвоєнням особистості і дуже сильно бажає отримати Кільце. Гобіти захоплюють його в полон і наказують вести їх до підніжжя Фатальної гори. Меррі та Піппін потрапляють в табір орків урук-хаїв, який підпорядковується Саурону, але коли табір атакують конярі Рогану гобітам вдається врятуватися втечею. Тим часом темна армія Саурона наближається до стін Голмової Ущелини, де повинна відбутися велика битва.",
                    Image = "/img/10.jpg"
                });
                SaveChanges();
            };
        }
    }
}
